Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_uarte.h
// SUBSCRIBE_STARTTX Configuration

#define UARTE_SUBSCRIBE_STARTTX_EN                              (0x1U<<31)
#define UARTE_SUBSCRIBE_STARTTX_CHIDX                           (0xFFU<<0)
#define UARTE_SUBSCRIBE_STARTTX_CHIDX_0                         (0x1U<<0)
#define UARTE_SUBSCRIBE_STARTTX_EN_DISABLED                     (0x0U<<31)
#define UARTE_SUBSCRIBE_STARTTX_EN_ENABLED                      (0x1U<<31)

// SUBSCRIBE_STOPTX Configuration

#define UARTE_SUBSCRIBE_STOPTX_EN                               (0x1U<<31)
#define UARTE_SUBSCRIBE_STOPTX_CHIDX                            (0xFFU<<0)
#define UARTE_SUBSCRIBE_STOPTX_CHIDX_0                          (0x1U<<0)
#define UARTE_SUBSCRIBE_STOPTX_EN_DISABLED                      (0x0U<<31)
#define UARTE_SUBSCRIBE_STOPTX_EN_ENABLED                       (0x1U<<31)

// SUBSCRIBE_FLUSHRX Configuration

#define UARTE_SUBSCRIBE_FLUSHRX_EN                              (0x1U<<31)
#define UARTE_SUBSCRIBE_FLUSHRX_CHIDX                           (0xFFU<<0)
#define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_0                         (0x1U<<0)
#define UARTE_SUBSCRIBE_FLUSHRX_EN_DISABLED                     (0x0U<<31)
#define UARTE_SUBSCRIBE_FLUSHRX_EN_ENABLED                      (0x1U<<31)

// EVENTS_CTS Configuration

#define UARTE_EVENTS_CTS_EVENTS_CTS                             (0x1U<<0)
#define UARTE_EVENTS_CTS_EVENTS_CTS_NOTGENERATED                (0x0U<<0)
#define UARTE_EVENTS_CTS_EVENTS_CTS_GENERATED                   (0x1U<<0)

// EVENTS_NCTS Configuration

#define UARTE_EVENTS_NCTS_EVENTS_NCTS                           (0x1U<<0)
#define UARTE_EVENTS_NCTS_EVENTS_NCTS_NOTGENERATED              (0x0U<<0)
#define UARTE_EVENTS_NCTS_EVENTS_NCTS_GENERATED                 (0x1U<<0)

// EVENTS_RXDRDY Configuration

#define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY                       (0x1U<<0)
#define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_NOTGENERATED          (0x0U<<0)
#define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_GENERATED             (0x1U<<0)

// EVENTS_ENDRX Configuration

#define UARTE_EVENTS_ENDRX_EVENTS_ENDRX                         (0x1U<<0)
#define UARTE_EVENTS_ENDRX_EVENTS_ENDRX_NOTGENERATED            (0x0U<<0)
#define UARTE_EVENTS_ENDRX_EVENTS_ENDRX_GENERATED               (0x1U<<0)

// EVENTS_TXDRDY Configuration

#define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY                       (0x1U<<0)
#define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_NOTGENERATED          (0x0U<<0)
#define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_GENERATED             (0x1U<<0)

// EVENTS_ENDTX Configuration

#define UARTE_EVENTS_ENDTX_EVENTS_ENDTX                         (0x1U<<0)
#define UARTE_EVENTS_ENDTX_EVENTS_ENDTX_NOTGENERATED            (0x0U<<0)
#define UARTE_EVENTS_ENDTX_EVENTS_ENDTX_GENERATED               (0x1U<<0)

// EVENTS_ERROR Configuration

#define UARTE_EVENTS_ERROR_EVENTS_ERROR                         (0x1U<<0)
#define UARTE_EVENTS_ERROR_EVENTS_ERROR_NOTGENERATED            (0x0U<<0)
#define UARTE_EVENTS_ERROR_EVENTS_ERROR_GENERATED               (0x1U<<0)

// EVENTS_RXTO Configuration

#define UARTE_EVENTS_RXTO_EVENTS_RXTO                           (0x1U<<0)
#define UARTE_EVENTS_RXTO_EVENTS_RXTO_NOTGENERATED              (0x0U<<0)
#define UARTE_EVENTS_RXTO_EVENTS_RXTO_GENERATED                 (0x1U<<0)

// EVENTS_RXSTARTED Configuration

#define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED                 (0x1U<<0)
#define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_NOTGENERATED    (0x0U<<0)
#define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_GENERATED       (0x1U<<0)

// EVENTS_TXSTARTED Configuration

#define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED                 (0x1U<<0)
#define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_NOTGENERATED    (0x0U<<0)
#define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_GENERATED       (0x1U<<0)

// EVENTS_TXSTOPPED Configuration

#define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED                 (0x1U<<0)
#define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_NOTGENERATED    (0x0U<<0)
#define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_GENERATED       (0x1U<<0)

// PUBLISH_CTS Configuration

#define UARTE_PUBLISH_CTS_EN                                    (0x1U<<31)
#define UARTE_PUBLISH_CTS_CHIDX                                 (0xFFU<<0)
#define UARTE_PUBLISH_CTS_CHIDX_0                               (0x1U<<0)
#define UARTE_PUBLISH_CTS_EN_DISABLED                           (0x0U<<31)
#define UARTE_PUBLISH_CTS_EN_ENABLED                            (0x1U<<31)

// PUBLISH_NCTS Configuration

#define UARTE_PUBLISH_NCTS_EN                                   (0x1U<<31)
#define UARTE_PUBLISH_NCTS_CHIDX                                (0xFFU<<0)
#define UARTE_PUBLISH_NCTS_CHIDX_0                              (0x1U<<0)
#define UARTE_PUBLISH_NCTS_EN_DISABLED                          (0x0U<<31)
#define UARTE_PUBLISH_NCTS_EN_ENABLED                           (0x1U<<31)

// PUBLISH_RXDRDY Configuration

#define UARTE_PUBLISH_RXDRDY_EN                                 (0x1U<<31)
#define UARTE_PUBLISH_RXDRDY_CHIDX                              (0xFFU<<0)
#define UARTE_PUBLISH_RXDRDY_CHIDX_0                            (0x1U<<0)
#define UARTE_PUBLISH_RXDRDY_EN_DISABLED                        (0x0U<<31)
#define UARTE_PUBLISH_RXDRDY_EN_ENABLED                         (0x1U<<31)

// PUBLISH_ENDRX Configuration

#define UARTE_PUBLISH_ENDRX_EN                                  (0x1U<<31)
#define UARTE_PUBLISH_ENDRX_CHIDX                               (0xFFU<<0)
#define UARTE_PUBLISH_ENDRX_CHIDX_0                             (0x1U<<0)
#define UARTE_PUBLISH_ENDRX_EN_DISABLED                         (0x0U<<31)
#define UARTE_PUBLISH_ENDRX_EN_ENABLED                          (0x1U<<31)

// PUBLISH_TXDRDY Configuration

#define UARTE_PUBLISH_TXDRDY_EN                                 (0x1U<<31)
#define UARTE_PUBLISH_TXDRDY_CHIDX                              (0xFFU<<0)
#define UARTE_PUBLISH_TXDRDY_CHIDX_0                            (0x1U<<0)
#define UARTE_PUBLISH_TXDRDY_EN_DISABLED                        (0x0U<<31)
#define UARTE_PUBLISH_TXDRDY_EN_ENABLED                         (0x1U<<31)

// PUBLISH_ENDTX Configuration

#define UARTE_PUBLISH_ENDTX_EN                                  (0x1U<<31)
#define UARTE_PUBLISH_ENDTX_CHIDX                               (0xFFU<<0)
#define UARTE_PUBLISH_ENDTX_CHIDX_0                             (0x1U<<0)
#define UARTE_PUBLISH_ENDTX_EN_DISABLED                         (0x0U<<31)
#define UARTE_PUBLISH_ENDTX_EN_ENABLED                          (0x1U<<31)

// PUBLISH_ERROR Configuration

