Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_uarte.h
#define UARTE_PUBLISH_ERROR_EN                                  (0x1U<<31)
#define UARTE_PUBLISH_ERROR_CHIDX                               (0xFFU<<0)
#define UARTE_PUBLISH_ERROR_CHIDX_0                             (0x1U<<0)
#define UARTE_PUBLISH_ERROR_EN_DISABLED                         (0x0U<<31)
#define UARTE_PUBLISH_ERROR_EN_ENABLED                          (0x1U<<31)

// PUBLISH_RXTO Configuration

#define UARTE_PUBLISH_RXTO_EN                                   (0x1U<<31)
#define UARTE_PUBLISH_RXTO_CHIDX                                (0xFFU<<0)
#define UARTE_PUBLISH_RXTO_CHIDX_0                              (0x1U<<0)
#define UARTE_PUBLISH_RXTO_EN_DISABLED                          (0x0U<<31)
#define UARTE_PUBLISH_RXTO_EN_ENABLED                           (0x1U<<31)

// PUBLISH_RXSTARTED Configuration

#define UARTE_PUBLISH_RXSTARTED_EN                              (0x1U<<31)
#define UARTE_PUBLISH_RXSTARTED_CHIDX                           (0xFFU<<0)
#define UARTE_PUBLISH_RXSTARTED_CHIDX_0                         (0x1U<<0)
#define UARTE_PUBLISH_RXSTARTED_EN_DISABLED                     (0x0U<<31)
#define UARTE_PUBLISH_RXSTARTED_EN_ENABLED                      (0x1U<<31)

// PUBLISH_TXSTARTED Configuration

#define UARTE_PUBLISH_TXSTARTED_EN                              (0x1U<<31)
#define UARTE_PUBLISH_TXSTARTED_CHIDX                           (0xFFU<<0)
#define UARTE_PUBLISH_TXSTARTED_CHIDX_0                         (0x1U<<0)
#define UARTE_PUBLISH_TXSTARTED_EN_DISABLED                     (0x0U<<31)
#define UARTE_PUBLISH_TXSTARTED_EN_ENABLED                      (0x1U<<31)

// PUBLISH_TXSTOPPED Configuration

#define UARTE_PUBLISH_TXSTOPPED_EN                              (0x1U<<31)
#define UARTE_PUBLISH_TXSTOPPED_CHIDX                           (0xFFU<<0)
#define UARTE_PUBLISH_TXSTOPPED_CHIDX_0                         (0x1U<<0)
#define UARTE_PUBLISH_TXSTOPPED_EN_DISABLED                     (0x0U<<31)
#define UARTE_PUBLISH_TXSTOPPED_EN_ENABLED                      (0x1U<<31)

// SHORTS Configuration

#define UARTE_SHORTS_ENDRX_STOPRX                               (0x1U<<6)
#define UARTE_SHORTS_ENDRX_STARTRX                              (0x1U<<5)
#define UARTE_SHORTS_ENDRX_STOPRX_DISABLED                      (0x0U<<6)
#define UARTE_SHORTS_ENDRX_STOPRX_ENABLED                       (0x1U<<6)
#define UARTE_SHORTS_ENDRX_STARTRX_DISABLED                     (0x0U<<5)
#define UARTE_SHORTS_ENDRX_STARTRX_ENABLED                      (0x1U<<5)

// INTEN Configuration

#define UARTE_INTEN_TXSTOPPED                                   (0x1U<<22)
#define UARTE_INTEN_TXSTARTED                                   (0x1U<<20)
#define UARTE_INTEN_RXSTARTED                                   (0x1U<<19)
#define UARTE_INTEN_RXTO                                        (0x1U<<17)
#define UARTE_INTEN_ERROR                                       (0x1U<<9)
#define UARTE_INTEN_ENDTX                                       (0x1U<<8)
#define UARTE_INTEN_TXDRDY                                      (0x1U<<7)
#define UARTE_INTEN_ENDRX                                       (0x1U<<4)
#define UARTE_INTEN_RXDRDY                                      (0x1U<<2)
#define UARTE_INTEN_NCTS                                        (0x1U<<1)
#define UARTE_INTEN_CTS                                         (0x1U<<0)
#define UARTE_INTEN_TXSTOPPED_DISABLED                          (0x0U<<22)
#define UARTE_INTEN_TXSTOPPED_ENABLED                           (0x1U<<22)
#define UARTE_INTEN_TXSTARTED_DISABLED                          (0x0U<<20)
#define UARTE_INTEN_TXSTARTED_ENABLED                           (0x1U<<20)
#define UARTE_INTEN_RXSTARTED_DISABLED                          (0x0U<<19)
#define UARTE_INTEN_RXSTARTED_ENABLED                           (0x1U<<19)
#define UARTE_INTEN_RXTO_DISABLED                               (0x0U<<17)
#define UARTE_INTEN_RXTO_ENABLED                                (0x1U<<17)
#define UARTE_INTEN_ERROR_DISABLED                              (0x0U<<9)
#define UARTE_INTEN_ERROR_ENABLED                               (0x1U<<9)
#define UARTE_INTEN_ENDTX_DISABLED                              (0x0U<<8)
#define UARTE_INTEN_ENDTX_ENABLED                               (0x1U<<8)
#define UARTE_INTEN_TXDRDY_DISABLED                             (0x0U<<7)
#define UARTE_INTEN_TXDRDY_ENABLED                              (0x1U<<7)
#define UARTE_INTEN_ENDRX_DISABLED                              (0x0U<<4)
#define UARTE_INTEN_ENDRX_ENABLED                               (0x1U<<4)
#define UARTE_INTEN_RXDRDY_DISABLED                             (0x0U<<2)
#define UARTE_INTEN_RXDRDY_ENABLED                              (0x1U<<2)
#define UARTE_INTEN_NCTS_DISABLED                               (0x0U<<1)
#define UARTE_INTEN_NCTS_ENABLED                                (0x1U<<1)
#define UARTE_INTEN_CTS_DISABLED                                (0x0U<<0)
#define UARTE_INTEN_CTS_ENABLED                                 (0x1U<<0)

// INTENSET Configuration

#define UARTE_INTENSET_TXSTOPPED                                (0x1U<<22)
#define UARTE_INTENSET_TXSTARTED                                (0x1U<<20)
#define UARTE_INTENSET_RXSTARTED                                (0x1U<<19)
#define UARTE_INTENSET_RXTO                                     (0x1U<<17)
#define UARTE_INTENSET_ERROR                                    (0x1U<<9)
#define UARTE_INTENSET_ENDTX                                    (0x1U<<8)
#define UARTE_INTENSET_TXDRDY                                   (0x1U<<7)
#define UARTE_INTENSET_ENDRX                                    (0x1U<<4)
#define UARTE_INTENSET_RXDRDY                                   (0x1U<<2)
#define UARTE_INTENSET_NCTS                                     (0x1U<<1)
#define UARTE_INTENSET_CTS                                      (0x1U<<0)
#define UARTE_INTENSET_TXSTOPPED_DISABLED                       (0x0U<<22)
#define UARTE_INTENSET_TXSTOPPED_ENABLED                        (0x1U<<22)
#define UARTE_INTENSET_TXSTOPPED_SET                            (0x1U<<22)
#define UARTE_INTENSET_TXSTARTED_DISABLED                       (0x0U<<20)
#define UARTE_INTENSET_TXSTARTED_ENABLED                        (0x1U<<20)
#define UARTE_INTENSET_TXSTARTED_SET                            (0x1U<<20)
#define UARTE_INTENSET_RXSTARTED_DISABLED                       (0x0U<<19)
#define UARTE_INTENSET_RXSTARTED_ENABLED                        (0x1U<<19)
#define UARTE_INTENSET_RXSTARTED_SET                            (0x1U<<19)
#define UARTE_INTENSET_RXTO_DISABLED                            (0x0U<<17)
#define UARTE_INTENSET_RXTO_ENABLED                             (0x1U<<17)
#define UARTE_INTENSET_RXTO_SET                                 (0x1U<<17)
#define UARTE_INTENSET_ERROR_DISABLED                           (0x0U<<9)
#define UARTE_INTENSET_ERROR_ENABLED                            (0x1U<<9)
#define UARTE_INTENSET_ERROR_SET                                (0x1U<<9)
#define UARTE_INTENSET_ENDTX_DISABLED                           (0x0U<<8)
#define UARTE_INTENSET_ENDTX_ENABLED                            (0x1U<<8)
#define UARTE_INTENSET_ENDTX_SET                                (0x1U<<8)
#define UARTE_INTENSET_TXDRDY_DISABLED                          (0x0U<<7)
#define UARTE_INTENSET_TXDRDY_ENABLED                           (0x1U<<7)
#define UARTE_INTENSET_TXDRDY_SET                               (0x1U<<7)
#define UARTE_INTENSET_ENDRX_DISABLED                           (0x0U<<4)
#define UARTE_INTENSET_ENDRX_ENABLED                            (0x1U<<4)
#define UARTE_INTENSET_ENDRX_SET                                (0x1U<<4)
#define UARTE_INTENSET_RXDRDY_DISABLED                          (0x0U<<2)
#define UARTE_INTENSET_RXDRDY_ENABLED                           (0x1U<<2)
#define UARTE_INTENSET_RXDRDY_SET                               (0x1U<<2)
#define UARTE_INTENSET_NCTS_DISABLED                            (0x0U<<1)
#define UARTE_INTENSET_NCTS_ENABLED                             (0x1U<<1)
#define UARTE_INTENSET_NCTS_SET                                 (0x1U<<1)
#define UARTE_INTENSET_CTS_DISABLED                             (0x0U<<0)
#define UARTE_INTENSET_CTS_ENABLED                              (0x1U<<0)
#define UARTE_INTENSET_CTS_SET                                  (0x1U<<0)

// INTENCLR Configuration

#define UARTE_INTENCLR_TXSTOPPED                                (0x1U<<22)
#define UARTE_INTENCLR_TXSTARTED                                (0x1U<<20)
#define UARTE_INTENCLR_RXSTARTED                                (0x1U<<19)
#define UARTE_INTENCLR_RXTO                                     (0x1U<<17)
#define UARTE_INTENCLR_ERROR                                    (0x1U<<9)
#define UARTE_INTENCLR_ENDTX                                    (0x1U<<8)
#define UARTE_INTENCLR_TXDRDY                                   (0x1U<<7)
#define UARTE_INTENCLR_ENDRX                                    (0x1U<<4)
#define UARTE_INTENCLR_RXDRDY                                   (0x1U<<2)
#define UARTE_INTENCLR_NCTS                                     (0x1U<<1)
#define UARTE_INTENCLR_CTS                                      (0x1U<<0)
#define UARTE_INTENCLR_TXSTOPPED_DISABLED                       (0x0U<<22)
#define UARTE_INTENCLR_TXSTOPPED_ENABLED                        (0x1U<<22)
#define UARTE_INTENCLR_TXSTOPPED_CLEAR                          (0x1U<<22)
#define UARTE_INTENCLR_TXSTARTED_DISABLED                       (0x0U<<20)
#define UARTE_INTENCLR_TXSTARTED_ENABLED                        (0x1U<<20)
#define UARTE_INTENCLR_TXSTARTED_CLEAR                          (0x1U<<20)
#define UARTE_INTENCLR_RXSTARTED_DISABLED                       (0x0U<<19)
#define UARTE_INTENCLR_RXSTARTED_ENABLED                        (0x1U<<19)
#define UARTE_INTENCLR_RXSTARTED_CLEAR                          (0x1U<<19)
#define UARTE_INTENCLR_RXTO_DISABLED                            (0x0U<<17)
#define UARTE_INTENCLR_RXTO_ENABLED                             (0x1U<<17)
#define UARTE_INTENCLR_RXTO_CLEAR                               (0x1U<<17)
#define UARTE_INTENCLR_ERROR_DISABLED                           (0x0U<<9)
#define UARTE_INTENCLR_ERROR_ENABLED                            (0x1U<<9)
#define UARTE_INTENCLR_ERROR_CLEAR                              (0x1U<<9)
#define UARTE_INTENCLR_ENDTX_DISABLED                           (0x0U<<8)
#define UARTE_INTENCLR_ENDTX_ENABLED                            (0x1U<<8)
#define UARTE_INTENCLR_ENDTX_CLEAR                              (0x1U<<8)
#define UARTE_INTENCLR_TXDRDY_DISABLED                          (0x0U<<7)
#define UARTE_INTENCLR_TXDRDY_ENABLED                           (0x1U<<7)
#define UARTE_INTENCLR_TXDRDY_CLEAR                             (0x1U<<7)
#define UARTE_INTENCLR_ENDRX_DISABLED                           (0x0U<<4)
#define UARTE_INTENCLR_ENDRX_ENABLED                            (0x1U<<4)
#define UARTE_INTENCLR_ENDRX_CLEAR                              (0x1U<<4)
#define UARTE_INTENCLR_RXDRDY_DISABLED                          (0x0U<<2)
#define UARTE_INTENCLR_RXDRDY_ENABLED                           (0x1U<<2)
#define UARTE_INTENCLR_RXDRDY_CLEAR                             (0x1U<<2)
#define UARTE_INTENCLR_NCTS_DISABLED                            (0x0U<<1)
#define UARTE_INTENCLR_NCTS_ENABLED                             (0x1U<<1)
#define UARTE_INTENCLR_NCTS_CLEAR                               (0x1U<<1)
#define UARTE_INTENCLR_CTS_DISABLED                             (0x0U<<0)
#define UARTE_INTENCLR_CTS_ENABLED                              (0x1U<<0)
#define UARTE_INTENCLR_CTS_CLEAR                                (0x1U<<0)

